app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My article title"], ["description", "My article description"], ["created_at", "2020-10-29 22:57:41.175244"], ["updated_at", "2020-10-29 22:57:41.175244"]]
---
  def create
    @article.title = params[:title]
    @article.description = params[:description]
    @article.save

UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2020-10-29 22:57:41.238963"], ["id", 1]]
---
  def update
    @article.update(sanitized_params)